# GetCoreWallComponent

## Description
Gets the core wall component of an object.

```pascal
FUNCTION GetCoreWallComponent(obj : HANDLE): INTEGER;
```

```python
def vs.GetCoreWallComponent(obj):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|obj|HANDLE|The object. Can be a wall, round wall, Wall Style, or the Wall Preferences.|

## See Also
VS Functions:
SetCoreWallComponent

## Version
Availability: from Vectorworks 2010

## Category
* Objects - Architectural